# BasePoint Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CylindricalHelix..::..BasePoint Property
CylindricalHelix Class See Also
---
The base point of the axis of the cylindrical helix.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ BasePoint { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BasePoint As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ BasePoint {
	XYZ^ get ();
}
```

# See Also
CylindricalHelix Class
Autodesk.Revit.DB Namespace